arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr57xxgeneric.h
/* CDCTL1 Control Bits */
#define CDOUT               (0x0001u)  /* Comp. D Output */
#define CDOUTPOL            (0x0002u)  /* Comp. D Output Polarity */
#define CDF                 (0x0004u)  /* Comp. D Enable Output Filter */
#define CDIES               (0x0008u)  /* Comp. D Interrupt Edge Select */
#define CDSHORT             (0x0010u)  /* Comp. D Input Short */
#define CDEX                (0x0020u)  /* Comp. D Exchange Inputs */
#define CDFDLY0             (0x0040u)  /* Comp. D Filter delay Bit 0 */
#define CDFDLY1             (0x0080u)  /* Comp. D Filter delay Bit 1 */
//#define RESERVED            (0x0100u)  /* Comp. D */
//#define RESERVED            (0x0200u)  /* Comp. D */
#define CDON                (0x0400u)  /* Comp. D enable */
#define CDMRVL              (0x0800u)  /* Comp. D CDMRV Level */
#define CDMRVS              (0x1000u)  /* Comp. D Output selects between VREF0 or VREF1*/
//#define RESERVED            (0x2000u)  /* Comp. D */
//#define RESERVED            (0x4000u)  /* Comp. D */
//#define RESERVED            (0x8000u)  /* Comp. D */

/* CDCTL1 Control Bits */
#define CDOUT_L             (0x0001u)  /* Comp. D Output */
#define CDOUTPOL_L          (0x0002u)  /* Comp. D Output Polarity */
#define CDF_L               (0x0004u)  /* Comp. D Enable Output Filter */
#define CDIES_L             (0x0008u)  /* Comp. D Interrupt Edge Select */
#define CDSHORT_L           (0x0010u)  /* Comp. D Input Short */
#define CDEX_L              (0x0020u)  /* Comp. D Exchange Inputs */
#define CDFDLY0_L           (0x0040u)  /* Comp. D Filter delay Bit 0 */
#define CDFDLY1_L           (0x0080u)  /* Comp. D Filter delay Bit 1 */
//#define RESERVED            (0x0100u)  /* Comp. D */
//#define RESERVED            (0x0200u)  /* Comp. D */
//#define RESERVED            (0x2000u)  /* Comp. D */
//#define RESERVED            (0x4000u)  /* Comp. D */
//#define RESERVED            (0x8000u)  /* Comp. D */

/* CDCTL1 Control Bits */
//#define RESERVED            (0x0100u)  /* Comp. D */
//#define RESERVED            (0x0200u)  /* Comp. D */
#define CDON_H              (0x0004u)  /* Comp. D enable */
#define CDMRVL_H            (0x0008u)  /* Comp. D CDMRV Level */
#define CDMRVS_H            (0x0010u)  /* Comp. D Output selects between VREF0 or VREF1*/
//#define RESERVED            (0x2000u)  /* Comp. D */
//#define RESERVED            (0x4000u)  /* Comp. D */
//#define RESERVED            (0x8000u)  /* Comp. D */

#define CDFDLY_0           (0x0000u)  /* Comp. D Filter delay 0 : 450ns */
#define CDFDLY_1           (0x0040u)  /* Comp. D Filter delay 1 : 900ns */
#define CDFDLY_2           (0x0080u)  /* Comp. D Filter delay 2 : 1800ns */
#define CDFDLY_3           (0x00C0u)  /* Comp. D Filter delay 3 : 3600ns */

/* CDCTL2 Control Bits */
#define CDREF00             (0x0001u)  /* Comp. D Reference 0 Resistor Select Bit : 0 */
#define CDREF01             (0x0002u)  /* Comp. D Reference 0 Resistor Select Bit : 1 */
#define CDREF02             (0x0004u)  /* Comp. D Reference 0 Resistor Select Bit : 2 */
#define CDREF03             (0x0008u)  /* Comp. D Reference 0 Resistor Select Bit : 3 */
#define CDREF04             (0x0010u)  /* Comp. D Reference 0 Resistor Select Bit : 4 */
#define CDRSEL              (0x0020u)  /* Comp. D Reference select */
#define CDRS0               (0x0040u)  /* Comp. D Reference Source Bit : 0 */
#define CDRS1               (0x0080u)  /* Comp. D Reference Source Bit : 1 */
#define CDREF10             (0x0100u)  /* Comp. D Reference 1 Resistor Select Bit : 0 */
#define CDREF11             (0x0200u)  /* Comp. D Reference 1 Resistor Select Bit : 1 */
#define CDREF12             (0x0400u)  /* Comp. D Reference 1 Resistor Select Bit : 2 */
#define CDREF13             (0x0800u)  /* Comp. D Reference 1 Resistor Select Bit : 3 */
#define CDREF14             (0x1000u)  /* Comp. D Reference 1 Resistor Select Bit : 4 */
#define CDREFL0             (0x2000u)  /* Comp. D Reference voltage level Bit : 0 */
#define CDREFL1             (0x4000u)  /* Comp. D Reference voltage level Bit : 1 */
#define CDREFACC            (0x8000u)  /* Comp. D Reference Accuracy */

/* CDCTL2 Control Bits */
#define CDREF00_L           (0x0001u)  /* Comp. D Reference 0 Resistor Select Bit : 0 */
#define CDREF01_L           (0x0002u)  /* Comp. D Reference 0 Resistor Select Bit : 1 */
#define CDREF02_L           (0x0004u)  /* Comp. D Reference 0 Resistor Select Bit : 2 */
#define CDREF03_L           (0x0008u)  /* Comp. D Reference 0 Resistor Select Bit : 3 */
#define CDREF04_L           (0x0010u)  /* Comp. D Reference 0 Resistor Select Bit : 4 */
#define CDRSEL_L            (0x0020u)  /* Comp. D Reference select */
#define CDRS0_L             (0x0040u)  /* Comp. D Reference Source Bit : 0 */
#define CDRS1_L             (0x0080u)  /* Comp. D Reference Source Bit : 1 */

/* CDCTL2 Control Bits */
#define CDREF10_H           (0x0001u)  /* Comp. D Reference 1 Resistor Select Bit : 0 */
#define CDREF11_H           (0x0002u)  /* Comp. D Reference 1 Resistor Select Bit : 1 */
#define CDREF12_H           (0x0004u)  /* Comp. D Reference 1 Resistor Select Bit : 2 */
#define CDREF13_H           (0x0008u)  /* Comp. D Reference 1 Resistor Select Bit : 3 */
#define CDREF14_H           (0x0010u)  /* Comp. D Reference 1 Resistor Select Bit : 4 */
#define CDREFL0_H           (0x0020u)  /* Comp. D Reference voltage level Bit : 0 */
#define CDREFL1_H           (0x0040u)  /* Comp. D Reference voltage level Bit : 1 */
#define CDREFACC_H          (0x0080u)  /* Comp. D Reference Accuracy */

#define CDREF0_0            (0x0000u)  /* Comp. D Int. Ref.0 Select 0 : 1/32 */
#define CDREF0_1            (0x0001u)  /* Comp. D Int. Ref.0 Select 1 : 2/32 */
#define CDREF0_2            (0x0002u)  /* Comp. D Int. Ref.0 Select 2 : 3/32 */
#define CDREF0_3            (0x0003u)  /* Comp. D Int. Ref.0 Select 3 : 4/32 */
#define CDREF0_4            (0x0004u)  /* Comp. D Int. Ref.0 Select 4 : 5/32 */
#define CDREF0_5            (0x0005u)  /* Comp. D Int. Ref.0 Select 5 : 6/32 */
#define CDREF0_6            (0x0006u)  /* Comp. D Int. Ref.0 Select 6 : 7/32 */
#define CDREF0_7            (0x0007u)  /* Comp. D Int. Ref.0 Select 7 : 8/32 */
#define CDREF0_8            (0x0008u)  /* Comp. D Int. Ref.0 Select 0 : 9/32 */
#define CDREF0_9            (0x0009u)  /* Comp. D Int. Ref.0 Select 1 : 10/32 */
#define CDREF0_10           (0x000Au)  /* Comp. D Int. Ref.0 Select 2 : 11/32 */
#define CDREF0_11           (0x000Bu)  /* Comp. D Int. Ref.0 Select 3 : 12/32 */
#define CDREF0_12           (0x000Cu)  /* Comp. D Int. Ref.0 Select 4 : 13/32 */
#define CDREF0_13           (0x000Du)  /* Comp. D Int. Ref.0 Select 5 : 14/32 */
#define CDREF0_14           (0x000Eu)  /* Comp. D Int. Ref.0 Select 6 : 15/32 */
#define CDREF0_15           (0x000Fu)  /* Comp. D Int. Ref.0 Select 7 : 16/32 */
#define CDREF0_16           (0x0010u)  /* Comp. D Int. Ref.0 Select 0 : 17/32 */
#define CDREF0_17           (0x0011u)  /* Comp. D Int. Ref.0 Select 1 : 18/32 */
#define CDREF0_18           (0x0012u)  /* Comp. D Int. Ref.0 Select 2 : 19/32 */
#define CDREF0_19           (0x0013u)  /* Comp. D Int. Ref.0 Select 3 : 20/32 */
#define CDREF0_20           (0x0014u)  /* Comp. D Int. Ref.0 Select 4 : 21/32 */
#define CDREF0_21           (0x0015u)  /* Comp. D Int. Ref.0 Select 5 : 22/32 */
#define CDREF0_22           (0x0016u)  /* Comp. D Int. Ref.0 Select 6 : 23/32 */
#define CDREF0_23           (0x0017u)  /* Comp. D Int. Ref.0 Select 7 : 24/32 */
#define CDREF0_24           (0x0018u)  /* Comp. D Int. Ref.0 Select 0 : 25/32 */
#define CDREF0_25           (0x0019u)  /* Comp. D Int. Ref.0 Select 1 : 26/32 */
#define CDREF0_26           (0x001Au)  /* Comp. D Int. Ref.0 Select 2 : 27/32 */
#define CDREF0_27           (0x001Bu)  /* Comp. D Int. Ref.0 Select 3 : 28/32 */
#define CDREF0_28           (0x001Cu)  /* Comp. D Int. Ref.0 Select 4 : 29/32 */
#define CDREF0_29           (0x001Du)  /* Comp. D Int. Ref.0 Select 5 : 30/32 */
#define CDREF0_30           (0x001Eu)  /* Comp. D Int. Ref.0 Select 6 : 31/32 */
#define CDREF0_31           (0x001Fu)  /* Comp. D Int. Ref.0 Select 7 : 32/32 */

#define CDRS_0              (0x0000u)  /* Comp. D Reference Source 0 : Off */
#define CDRS_1              (0x0040u)  /* Comp. D Reference Source 1 : Vcc */
#define CDRS_2              (0x0080u)  /* Comp. D Reference Source 2 : Shared Ref. */
#define CDRS_3              (0x00C0u)  /* Comp. D Reference Source 3 : Shared Ref. / Off */

#define CDREF1_0            (0x0000u)  /* Comp. D Int. Ref.1 Select 0 : 1/32 */
#define CDREF1_1            (0x0100u)  /* Comp. D Int. Ref.1 Select 1 : 2/32 */
#define CDREF1_2            (0x0200u)  /* Comp. D Int. Ref.1 Select 2 : 3/32 */
#define CDREF1_3            (0x0300u)  /* Comp. D Int. Ref.1 Select 3 : 4/32 */
#define CDREF1_4            (0x0400u)  /* Comp. D Int. Ref.1 Select 4 : 5/32 */
#define CDREF1_5            (0x0500u)  /* Comp. D Int. Ref.1 Select 5 : 6/32 */
#define CDREF1_6            (0x0600u)  /* Comp. D Int. Ref.1 Select 6 : 7/32 */
#define CDREF1_7            (0x0700u)  /* Comp. D Int. Ref.1 Select 7 : 8/32 */
#define CDREF1_8            (0x0800u)  /* Comp. D Int. Ref.1 Select 0 : 9/32 */
#define CDREF1_9            (0x0900u)  /* Comp. D Int. Ref.1 Select 1 : 10/32 */
#define CDREF1_10           (0x0A00u)  /* Comp. D Int. Ref.1 Select 2 : 11/32 */
#define CDREF1_11           (0x0B00u)  /* Comp. D Int. Ref.1 Select 3 : 12/32 */
#define CDREF1_12           (0x0C00u)  /* Comp. D Int. Ref.1 Select 4 : 13/32 */
#define CDREF1_13           (0x0D00u)  /* Comp. D Int. Ref.1 Select 5 : 14/32 */
#define CDREF1_14           (0x0E00u)  /* Comp. D Int. Ref.1 Select 6 : 15/32 */
#define CDREF1_15           (0x0F00u)  /* Comp. D Int. Ref.1 Select 7 : 16/32 */
#define CDREF1_16           (0x1000u)  /* Comp. D Int. Ref.1 Select 0 : 17/32 */
#define CDREF1_17           (0x1100u)  /* Comp. D Int. Ref.1 Select 1 : 18/32 */
#define CDREF1_18           (0x1200u)  /* Comp. D Int. Ref.1 Select 2 : 19/32 */
#define CDREF1_19           (0x1300u)  /* Comp. D Int. Ref.1 Select 3 : 20/32 */
#define CDREF1_20           (0x1400u)  /* Comp. D Int. Ref.1 Select 4 : 21/32 */
#define CDREF1_21           (0x1500u)  /* Comp. D Int. Ref.1 Select 5 : 22/32 */
#define CDREF1_22           (0x1600u)  /* Comp. D Int. Ref.1 Select 6 : 23/32 */
#define CDREF1_23           (0x1700u)  /* Comp. D Int. Ref.1 Select 7 : 24/32 */
#define CDREF1_24           (0x1800u)  /* Comp. D Int. Ref.1 Select 0 : 25/32 */
#define CDREF1_25           (0x1900u)  /* Comp. D Int. Ref.1 Select 1 : 26/32 */
#define CDREF1_26           (0x1A00u)  /* Comp. D Int. Ref.1 Select 2 : 27/32 */
#define CDREF1_27           (0x1B00u)  /* Comp. D Int. Ref.1 Select 3 : 28/32 */
#define CDREF1_28           (0x1C00u)  /* Comp. D Int. Ref.1 Select 4 : 29/32 */
#define CDREF1_29           (0x1D00u)  /* Comp. D Int. Ref.1 Select 5 : 30/32 */
#define CDREF1_30           (0x1E00u)  /* Comp. D Int. Ref.1 Select 6 : 31/32 */
#define CDREF1_31           (0x1F00u)  /* Comp. D Int. Ref.1 Select 7 : 32/32 */

