arduino/Arduino/hardware/msp430/libraries/DriverLib/utility/deprecated/iar/msp430fr57xxgeneric.h
#define CDREFL_0            (0x0000u)  /* Comp. D Reference voltage level 0 : None */
#define CDREFL_1            (0x2000u)  /* Comp. D Reference voltage level 1 : 1.5V */
#define CDREFL_2            (0x4000u)  /* Comp. D Reference voltage level 2 : 2.0V  */
#define CDREFL_3            (0x6000u)  /* Comp. D Reference voltage level 3 : 2.5V  */

#define CDPD0               (0x0001u)  /* Comp. D Disable Input Buffer of Port Register .0 */
#define CDPD1               (0x0002u)  /* Comp. D Disable Input Buffer of Port Register .1 */
#define CDPD2               (0x0004u)  /* Comp. D Disable Input Buffer of Port Register .2 */
#define CDPD3               (0x0008u)  /* Comp. D Disable Input Buffer of Port Register .3 */
#define CDPD4               (0x0010u)  /* Comp. D Disable Input Buffer of Port Register .4 */
#define CDPD5               (0x0020u)  /* Comp. D Disable Input Buffer of Port Register .5 */
#define CDPD6               (0x0040u)  /* Comp. D Disable Input Buffer of Port Register .6 */
#define CDPD7               (0x0080u)  /* Comp. D Disable Input Buffer of Port Register .7 */
#define CDPD8               (0x0100u)  /* Comp. D Disable Input Buffer of Port Register .8 */
#define CDPD9               (0x0200u)  /* Comp. D Disable Input Buffer of Port Register .9 */
#define CDPD10              (0x0400u)  /* Comp. D Disable Input Buffer of Port Register .10 */
#define CDPD11              (0x0800u)  /* Comp. D Disable Input Buffer of Port Register .11 */
#define CDPD12              (0x1000u)  /* Comp. D Disable Input Buffer of Port Register .12 */
#define CDPD13              (0x2000u)  /* Comp. D Disable Input Buffer of Port Register .13 */
#define CDPD14              (0x4000u)  /* Comp. D Disable Input Buffer of Port Register .14 */
#define CDPD15              (0x8000u)  /* Comp. D Disable Input Buffer of Port Register .15 */

#define CDPD0_L             (0x0001u)  /* Comp. D Disable Input Buffer of Port Register .0 */
#define CDPD1_L             (0x0002u)  /* Comp. D Disable Input Buffer of Port Register .1 */
#define CDPD2_L             (0x0004u)  /* Comp. D Disable Input Buffer of Port Register .2 */
#define CDPD3_L             (0x0008u)  /* Comp. D Disable Input Buffer of Port Register .3 */
#define CDPD4_L             (0x0010u)  /* Comp. D Disable Input Buffer of Port Register .4 */
#define CDPD5_L             (0x0020u)  /* Comp. D Disable Input Buffer of Port Register .5 */
#define CDPD6_L             (0x0040u)  /* Comp. D Disable Input Buffer of Port Register .6 */
#define CDPD7_L             (0x0080u)  /* Comp. D Disable Input Buffer of Port Register .7 */

#define CDPD8_H             (0x0001u)  /* Comp. D Disable Input Buffer of Port Register .8 */
#define CDPD9_H             (0x0002u)  /* Comp. D Disable Input Buffer of Port Register .9 */
#define CDPD10_H            (0x0004u)  /* Comp. D Disable Input Buffer of Port Register .10 */
#define CDPD11_H            (0x0008u)  /* Comp. D Disable Input Buffer of Port Register .11 */
#define CDPD12_H            (0x0010u)  /* Comp. D Disable Input Buffer of Port Register .12 */
#define CDPD13_H            (0x0020u)  /* Comp. D Disable Input Buffer of Port Register .13 */
#define CDPD14_H            (0x0040u)  /* Comp. D Disable Input Buffer of Port Register .14 */
#define CDPD15_H            (0x0080u)  /* Comp. D Disable Input Buffer of Port Register .15 */

/* CDINT Control Bits */
#define CDIFG                (0x0001u)  /* Comp. D Interrupt Flag */
#define CDIIFG               (0x0002u)  /* Comp. D Interrupt Flag Inverted Polarity */
//#define RESERVED             (0x0004u)  /* Comp. D */
//#define RESERVED             (0x0008u)  /* Comp. D */
//#define RESERVED             (0x0010u)  /* Comp. D */
//#define RESERVED             (0x0020u)  /* Comp. D */
//#define RESERVED             (0x0040u)  /* Comp. D */
//#define RESERVED             (0x0080u)  /* Comp. D */
#define CDIE                 (0x0100u)  /* Comp. D Interrupt Enable */
#define CDIIE                (0x0200u)  /* Comp. D Interrupt Enable Inverted Polarity */
//#define RESERVED             (0x0400u)  /* Comp. D */
//#define RESERVED             (0x0800u)  /* Comp. D */
//#define RESERVED             (0x1000u)  /* Comp. D */
//#define RESERVED             (0x2000u)  /* Comp. D */
//#define RESERVED             (0x4000u)  /* Comp. D */
//#define RESERVED             (0x8000u)  /* Comp. D */

/* CDINT Control Bits */
#define CDIFG_L             (0x0001u)  /* Comp. D Interrupt Flag */
#define CDIIFG_L            (0x0002u)  /* Comp. D Interrupt Flag Inverted Polarity */
//#define RESERVED             (0x0004u)  /* Comp. D */
//#define RESERVED             (0x0008u)  /* Comp. D */
//#define RESERVED             (0x0010u)  /* Comp. D */
//#define RESERVED             (0x0020u)  /* Comp. D */
//#define RESERVED             (0x0040u)  /* Comp. D */
//#define RESERVED             (0x0080u)  /* Comp. D */
//#define RESERVED             (0x0400u)  /* Comp. D */
//#define RESERVED             (0x0800u)  /* Comp. D */
//#define RESERVED             (0x1000u)  /* Comp. D */
//#define RESERVED             (0x2000u)  /* Comp. D */
//#define RESERVED             (0x4000u)  /* Comp. D */
//#define RESERVED             (0x8000u)  /* Comp. D */

/* CDINT Control Bits */
//#define RESERVED             (0x0004u)  /* Comp. D */
//#define RESERVED             (0x0008u)  /* Comp. D */
//#define RESERVED             (0x0010u)  /* Comp. D */
//#define RESERVED             (0x0020u)  /* Comp. D */
//#define RESERVED             (0x0040u)  /* Comp. D */
//#define RESERVED             (0x0080u)  /* Comp. D */
#define CDIE_H              (0x0001u)  /* Comp. D Interrupt Enable */
#define CDIIE_H             (0x0002u)  /* Comp. D Interrupt Enable Inverted Polarity */
//#define RESERVED             (0x0400u)  /* Comp. D */
//#define RESERVED             (0x0800u)  /* Comp. D */
//#define RESERVED             (0x1000u)  /* Comp. D */
//#define RESERVED             (0x2000u)  /* Comp. D */
//#define RESERVED             (0x4000u)  /* Comp. D */
//#define RESERVED             (0x8000u)  /* Comp. D */

/* CDIV Definitions */
#define CDIV_NONE           (0x0000u)    /* No Interrupt pending */
#define CDIV_CDIFG          (0x0002u)    /* CDIFG */
#define CDIV_CDIIFG         (0x0004u)    /* CDIIFG */

#endif
/*************************************************************
* CRC Module
*************************************************************/
#ifdef  __MSP430_HAS_CRC__            /* Definition to show that Module is available */

#define OFS_CRCDI             (0x0000u)  /* CRC Data In Register */
#define OFS_CRCDI_L            OFS_CRCDI
#define OFS_CRCDI_H            OFS_CRCDI+1
#define OFS_CRCDIRB           (0x0002u)  /* CRC data in reverse byte Register */
#define OFS_CRCDIRB_L          OFS_CRCDIRB
#define OFS_CRCDIRB_H          OFS_CRCDIRB+1
#define OFS_CRCINIRES         (0x0004u)  /* CRC Initialisation Register and Result Register */
#define OFS_CRCINIRES_L        OFS_CRCINIRES
#define OFS_CRCINIRES_H        OFS_CRCINIRES+1
#define OFS_CRCRESR           (0x0006u)  /* CRC reverse result Register */
#define OFS_CRCRESR_L          OFS_CRCRESR
#define OFS_CRCRESR_H          OFS_CRCRESR+1

#endif
/************************************************************
* CLOCK SYSTEM
************************************************************/
#ifdef  __MSP430_HAS_CS__              /* Definition to show that Module is available */

#define OFS_CSCTL0            (0x0000u)  /* CS Control Register 0 */
#define OFS_CSCTL0_L           OFS_CSCTL0
#define OFS_CSCTL0_H           OFS_CSCTL0+1
#define OFS_CSCTL1            (0x0002u)  /* CS Control Register 1 */
#define OFS_CSCTL1_L           OFS_CSCTL1
#define OFS_CSCTL1_H           OFS_CSCTL1+1
#define OFS_CSCTL2            (0x0004u)  /* CS Control Register 2 */
#define OFS_CSCTL2_L           OFS_CSCTL2
#define OFS_CSCTL2_H           OFS_CSCTL2+1
#define OFS_CSCTL3            (0x0006u)  /* CS Control Register 3 */
#define OFS_CSCTL3_L           OFS_CSCTL3
#define OFS_CSCTL3_H           OFS_CSCTL3+1
#define OFS_CSCTL4            (0x0008u)  /* CS Control Register 4 */
#define OFS_CSCTL4_L           OFS_CSCTL4
#define OFS_CSCTL4_H           OFS_CSCTL4+1
#define OFS_CSCTL5            (0x000Au)  /* CS Control Register 5 */
#define OFS_CSCTL5_L           OFS_CSCTL5
#define OFS_CSCTL5_H           OFS_CSCTL5+1
#define OFS_CSCTL6            (0x000Cu)  /* CS Control Register 6 */
#define OFS_CSCTL6_L           OFS_CSCTL6
#define OFS_CSCTL6_H           OFS_CSCTL6+1

/* CSCTL0 Control Bits */

